"""

Учимся работать с zip

"""


def my_zip(*iterables):
    """

    Напишите свою реализацию zip через генератор
    Обратите внимание, что zip останавливает итерацию, если хотя бы
    один из источник истощен

    """
    ...


def transpose(rows):
    """

    На вход подается прямоугольная матрица -- список списков.
    Используя zip, транспонируйте ее, т.е.

    1 2 3
    4 5 6

    переходит в

    1 4
    2 5
    3 6

    Обратите внимание, что на выходе должен быть тоже список списков, а не список кортежей!

    """

    ...
